eisup_2019_docmng_integration/src/InformationRegisters/абс_ВводБюджетаЗамечания/абс_ВводБюджетаЗамечания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ВводБюджетаЗамечания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Замечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументВводБюджета</name>
    <type>
      <types>DocumentRef.абс_ВводБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторЗамечания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ВводБюджетаЗамечания/Forms/ФормаЗамечанийУправляемая/Module.bsl
&НаКлиенте
Процедура КомандаЗакрыть(Команда)

	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьЗамечание(Команда)
	
	ДобавитьЗамечание();
	
	Элементы.ТаблицаЗамечания.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗамечание()
	
	Если НЕ ЗначениеЗаполнено(ТекЗамечание) Тогда
		
		Сообщить("Не введено замечание.");
		Возврат;
		
	КонецЕсли;
	
	НаборРегистра = РегистрыСведений.абс_ВводБюджетаЗамечания.СоздатьНаборЗаписей();
	
	НаборРегистра.Отбор.ДокументВводБюджета.Установить(ДокВводБюджета);
	НаборРегистра.Отбор.КлючСтроки.Установить(КлючСтроки);
	
	НаборРегистра.Прочитать();
	
	ЗаписьРегистра = НаборРегистра.Добавить();
	
	ЗаписьРегистра.КлючСтроки = КлючСтроки;
	ЗаписьРегистра.ДокументВводБюджета 	= ДокВводБюджета;
	
	ЗаписьРегистра.АвторЗамечания 		= глЗначениеПеременной("глТекущийПользователь");
	ЗаписьРегистра.Период				= ТекущаяДата();
	ЗаписьРегистра.Замечание			= ТекЗамечание;
	
	НаборРегистра.Записать();
	
	ТекЗамечание = "";
		
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекстНадписей();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстНадписей() 
	
	ТекстНадписи =    СокрЛП(Организация) 	+ " / " 
					+ СокрЛП(ЦФУ)	 		+ " / "
					+ СокрЛП(ЦФО);					
					
	Элементы.ДекорацияНадписьАналитика.Заголовок = ТекстНадписи;
	
	Элементы.ДекорацияНадписьВводПлана.Заголовок = ДокВводБюджета;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокВводБюджета 		= Параметры.ДокВводБюджета;
	Организация 		= Параметры.Организация;
	ЦФУ 				= Параметры.ЦФУ;
	ЦФО 				= Параметры.ЦФО;
	КлючСтроки 			= Параметры.КлючСтроки;
	
	
	ОтборДок = ТаблицаЗамечания.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборДок.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборДок.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДокументВводБюджета");
	ОтборДок.ПравоеЗначение = ДокВводБюджета;
	ОтборДок.Использование	= Истина;
	
	ОтборКлюч = ТаблицаЗамечания.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборКлюч.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборКлюч.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("КлючСтроки");
	ОтборКлюч.ПравоеЗначение = КлючСтроки;
	ОтборКлюч.Использование	= Истина;
	
КонецПроцедуры
